PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p16f1778.inc
;-----Bank8------------------
HIDRVB           EQU  H'040D'
TMR5             EQU  H'040F'
TMR5L            EQU  H'040F'
TMR5H            EQU  H'0410'
T5CON            EQU  H'0411'
T5GCON           EQU  H'0412'
T4TMR            EQU  H'0413'
TMR4             EQU  H'0413'
PR4              EQU  H'0414'
T4PR             EQU  H'0414'
T4CON            EQU  H'0415'
T4HLT            EQU  H'0416'
T4CLKCON         EQU  H'0417'
T4RST            EQU  H'0418'
T6TMR            EQU  H'041A'
TMR6             EQU  H'041A'
PR6              EQU  H'041B'
T6PR             EQU  H'041B'
T6CON            EQU  H'041C'
T6HLT            EQU  H'041D'
T6CLKCON         EQU  H'041E'
T6RST            EQU  H'041F'

;-----Bank9------------------
ADRESL           EQU  H'048E'
ADRESH           EQU  H'048F'
ADCON0           EQU  H'0490'
ADCON1           EQU  H'0491'
ADCON2           EQU  H'0492'
T2TMR            EQU  H'0493'
TMR2             EQU  H'0493'
PR2              EQU  H'0494'
T2PR             EQU  H'0494'
T2CON            EQU  H'0495'
T2HLT            EQU  H'0496'
T2CLKCON         EQU  H'0497'
T2RST            EQU  H'0498'
T8TMR            EQU  H'049A'
TMR8             EQU  H'049A'
PR8              EQU  H'049B'
T8PR             EQU  H'049B'
T8CON            EQU  H'049C'
T8HLT            EQU  H'049D'
T8CLKCON         EQU  H'049E'
T8RST            EQU  H'049F'

;-----Bank10------------------
OPA1NCHS         EQU  H'050F'
OPA1PCHS         EQU  H'0510'
OPA1CON          EQU  H'0511'
OPA1ORS          EQU  H'0512'
OPA2NCHS         EQU  H'0513'
OPA2PCHS         EQU  H'0514'
OPA2CON          EQU  H'0515'
OPA2ORS          EQU  H'0516'
OPA3NCHS         EQU  H'0517'
OPA3PCHS         EQU  H'0518'
OPA3CON          EQU  H'0519'
OPA3ORS          EQU  H'051A'

;-----Bank11------------------
DACLD            EQU  H'058D'
DAC1CON0         EQU  H'058E'
DAC1CON1         EQU  H'058F'
DAC1REF          EQU  H'058F'
DAC1REFL         EQU  H'058F'
DAC1CON2         EQU  H'0590'
DAC1REFH         EQU  H'0590'
DAC2CON0         EQU  H'0591'
DAC2CON1         EQU  H'0592'
DAC2REF          EQU  H'0592'
DAC2REFL         EQU  H'0592'
DAC2CON2         EQU  H'0593'
DAC2REFH         EQU  H'0593'
DAC3CON0         EQU  H'0594'
DAC3CON1         EQU  H'0595'
DAC3REF          EQU  H'0595'
DAC4CON0         EQU  H'0596'
DAC4CON1         EQU  H'0597'
DAC4REF          EQU  H'0597'
DAC5CON0         EQU  H'0598'
DAC5CON1         EQU  H'0599'
DAC5REF          EQU  H'0599'
DAC5REFL         EQU  H'0599'
DAC5CON2         EQU  H'059A'
DAC5REFH         EQU  H'059A'
DAC7CON0         EQU  H'059E'
DAC7CON1         EQU  H'059F'
DAC7REF          EQU  H'059F'

;-----Bank12------------------
PWM3DCL          EQU  H'0614'
PWM3DCH          EQU  H'0615'
PWM3CON          EQU  H'0616'
PWM4DCL          EQU  H'0617'
PWM4DCH          EQU  H'0618'
PWM4CON          EQU  H'0619'
PWM9DCL          EQU  H'061A'
PWM9DCH          EQU  H'061B'
PWM9CON          EQU  H'061C'

;-----Bank13------------------
COG1PHR          EQU  H'068D'
COG1PHF          EQU  H'068E'
COG1BLKR         EQU  H'068F'
COG1BLKF         EQU  H'0690'
COG1DBR          EQU  H'0691'
COG1DBF          EQU  H'0692'
COG1CON0         EQU  H'0693'
COG1CON1         EQU  H'0694'
COG1RIS0         EQU  H'0695'
COG1RIS1         EQU  H'0696'
COG1RSIM0        EQU  H'0697'
COG1RSIM1        EQU  H'0698'
COG1FIS0         EQU  H'0699'
COG1FIS1         EQU  H'069A'
COG1FSIM0        EQU  H'069B'
COG1FSIM1        EQU  H'069C'
COG1ASD0         EQU  H'069D'
COG1ASD1         EQU  H'069E'
COG1STR          EQU  H'069F'

;-----Bank14------------------
COG2PHR          EQU  H'070D'
COG2PHF          EQU  H'070E'
COG2BLKR         EQU  H'070F'
COG2BLKF         EQU  H'0710'
COG2DBR          EQU  H'0711'
COG2DBF          EQU  H'0712'
COG2CON0         EQU  H'0713'
COG2CON1         EQU  H'0714'
COG2RIS0         EQU  H'0715'
COG2RIS1         EQU  H'0716'
COG2RSIM0        EQU  H'0717'
COG2RSIM1        EQU  H'0718'
COG2FIS0         EQU  H'0719'
COG2FIS1         EQU  H'071A'
COG2FSIM0        EQU  H'071B'
COG2FSIM1        EQU  H'071C'
COG2ASD0         EQU  H'071D'
COG2ASD1         EQU  H'071E'
COG2STR          EQU  H'071F'

;-----Bank15------------------
PRG1RTSS         EQU  H'078E'
PRG1FTSS         EQU  H'078F'
PRG1INS          EQU  H'0790'
PRG1CON0         EQU  H'0791'
PRG1CON1         EQU  H'0792'
PRG1CON2         EQU  H'0793'
PRG2RTSS         EQU  H'0794'
PRG2FTSS         EQU  H'0795'
PRG2INS          EQU  H'0796'
PRG2CON0         EQU  H'0797'
PRG2CON1         EQU  H'0798'
PRG2CON2         EQU  H'0799'
PRG3RTSS         EQU  H'079A'
PRG3FTSS         EQU  H'079B'
PRG3INS          EQU  H'079C'
PRG3CON0         EQU  H'079D'
PRG3CON1         EQU  H'079E'
PRG3CON2         EQU  H'079F'

;-----Bank16------------------
COG3PHR          EQU  H'080D'
COG3PHF          EQU  H'080E'
COG3BLKR         EQU  H'080F'
COG3BLKF         EQU  H'0810'
COG3DBR          EQU  H'0811'
COG3DBF          EQU  H'0812'
COG3CON0         EQU  H'0813'
COG3CON1         EQU  H'0814'
COG3RIS0         EQU  H'0815'
COG3RIS1         EQU  H'0816'
COG3RSIM0        EQU  H'0817'
COG3RSIM1        EQU  H'0818'
COG3FIS0         EQU  H'0819'
COG3FIS1         EQU  H'081A'
COG3FSIM0        EQU  H'081B'
COG3FSIM1        EQU  H'081C'
COG3ASD0         EQU  H'081D'
COG3ASD1         EQU  H'081E'
COG3STR          EQU  H'081F'

;-----Bank18------------------
CM4CON0          EQU  H'090C'
CM4CON1          EQU  H'090D'
CM4NSEL          EQU  H'090E'
CM4PSEL          EQU  H'090F'
CM5CON0          EQU  H'0910'
CM5CON1          EQU  H'0911'
CM5NSEL          EQU  H'0912'
CM5PSEL          EQU  H'0913'
CM6CON0          EQU  H'0914'
CM6CON1          EQU  H'0915'
CM6NSEL          EQU  H'0916'
CM6PSEL          EQU  H'0917'

;-----Bank27------------------
PWMEN            EQU  H'0D8E'
PWMLD            EQU  H'0D8F'
PWMOUT           EQU  H'0D90'
PWM5PH           EQU  H'0D91'
PWM5PHL          EQU  H'0D91'
PWM5PHH          EQU  H'0D92'
PWM5DC           EQU  H'0D93'
PWM5DCL          EQU  H'0D93'
PWM5DCH          EQU  H'0D94'
PWM5PR           EQU  H'0D95'
PWM5PRL          EQU  H'0D95'
PWM5PRH          EQU  H'0D96'
PWM5OF           EQU  H'0D97'
PWM5OFL          EQU  H'0D97'
PWM5OFH          EQU  H'0D98'
PWM5TMR          EQU  H'0D99'
PWM5TMRL         EQU  H'0D99'
PWM5TMRH         EQU  H'0D9A'
PWM5CON          EQU  H'0D9B'
PWM5INTCON       EQU  H'0D9C'
PWM5INTE         EQU  H'0D9C'
PWM5INTF         EQU  H'0D9D'
PWM5INTFLG       EQU  H'0D9D'
PWM5CLKCON       EQU  H'0D9E'
PWM5LDCON        EQU  H'0D9F'
PWM5OFCON        EQU  H'0DA0'
PWM6PH           EQU  H'0DA1'
PWM6PHL          EQU  H'0DA1'
PWM6PHH          EQU  H'0DA2'
PWM6DC           EQU  H'0DA3'
PWM6DCL          EQU  H'0DA3'
PWM6DCH          EQU  H'0DA4'
PWM6PR           EQU  H'0DA5'
PWM6PRL          EQU  H'0DA5'
PWM6PRH          EQU  H'0DA6'
PWM6OF           EQU  H'0DA7'
PWM6OFL          EQU  H'0DA7'
PWM6OFH          EQU  H'0DA8'
PWM6TMR          EQU  H'0DA9'
PWM6TMRL         EQU  H'0DA9'
PWM6TMRH         EQU  H'0DAA'
PWM6CON          EQU  H'0DAB'
PWM6INTCON       EQU  H'0DAC'
PWM6INTE         EQU  H'0DAC'
PWM6INTF         EQU  H'0DAD'
PWM6INTFLG       EQU  H'0DAD'
PWM6CLKCON       EQU  H'0DAE'
PWM6LDCON        EQU  H'0DAF'
PWM6OFCON        EQU  H'0DB0'
PWM11PH          EQU  H'0DB1'
PWM11PHL         EQU  H'0DB1'
PWM11PHH         EQU  H'0DB2'
PWM11DC          EQU  H'0DB3'
PWM11DCL         EQU  H'0DB3'
PWM11DCH         EQU  H'0DB4'
PWM11PR          EQU  H'0DB5'
PWM11PRL         EQU  H'0DB5'
PWM11PRH         EQU  H'0DB6'
PWM11OF          EQU  H'0DB7'
PWM11OFL         EQU  H'0DB7'
PWM11OFH         EQU  H'0DB8'
PWM11TMR         EQU  H'0DB9'
PWM11TMRL        EQU  H'0DB9'
PWM11TMRH        EQU  H'0DBA'
PWM11CON         EQU  H'0DBB'
PWM11INTCON      EQU  H'0DBC'
PWM11INTE        EQU  H'0DBC'
PWM11INTF        EQU  H'0DBD'
PWM11INTFLG      EQU  H'0DBD'
PWM11CLKCON      EQU  H'0DBE'
PWM11LDCON       EQU  H'0DBF'
PWM11OFCON       EQU  H'0DC0'

;-----Bank28------------------
PPSLOCK          EQU  H'0E0C'
INTPPS           EQU  H'0E0D'
T0CKIPPS         EQU  H'0E0E'
T1CKIPPS         EQU  H'0E0F'
T1GPPS           EQU  H'0E10'
T3CKIPPS         EQU  H'0E11'
T3GPPS           EQU  H'0E12'
T5CKIPPS         EQU  H'0E13'
T5GPPS           EQU  H'0E14'
T2CKIPPS         EQU  H'0E15'
T4CKIPPS         EQU  H'0E16'
T6CKIPPS         EQU  H'0E17'
T8CKIPPS         EQU  H'0E18'
CCP1PPS          EQU  H'0E19'
CCP2PPS          EQU  H'0E1A'
CCP7PPS          EQU  H'0E1B'
COG1INPPS        EQU  H'0E1D'
COG2INPPS        EQU  H'0E1E'
COG3INPPS        EQU  H'0E1F'
MD1CLPPS         EQU  H'0E21'
MD1CHPPS         EQU  H'0E22'
MD1MODPPS        EQU  H'0E23'
MD2CLPPS         EQU  H'0E24'
MD2CHPPS         EQU  H'0E25'
MD2MODPPS        EQU  H'0E26'
MD3CLPPS         EQU  H'0E27'
MD3CHPPS         EQU  H'0E28'
MD3MODPPS        EQU  H'0E29'
PRG1RPPS         EQU  H'0E2D'
PRG1FPPS         EQU  H'0E2E'
PRG2RPPS         EQU  H'0E2F'
PRG2FPPS         EQU  H'0E30'
PRG3RPPS         EQU  H'0E31'
PRG3FPPS         EQU  H'0E32'
CLCIN0PPS        EQU  H'0E35'
CLCIN1PPS        EQU  H'0E36'
CLCIN2PPS        EQU  H'0E37'
CLCIN3PPS        EQU  H'0E38'
ADCACTPPS        EQU  H'0E39'
SSPCLKPPS        EQU  H'0E3A'
SSPDATPPS        EQU  H'0E3B'
SSPSSPPS         EQU  H'0E3C'
RXPPS            EQU  H'0E3D'
CKPPS            EQU  H'0E3E'

;-----Bank29------------------
RA0PPS           EQU  H'0E90'
RA1PPS           EQU  H'0E91'
RA2PPS           EQU  H'0E92'
RA3PPS           EQU  H'0E93'
RA4PPS           EQU  H'0E94'
RA5PPS           EQU  H'0E95'
RA6PPS           EQU  H'0E96'
RA7PPS           EQU  H'0E97'
RB0PPS           EQU  H'0E98'
RB1PPS           EQU  H'0E99'
RB2PPS           EQU  H'0E9A'
RB3PPS           EQU  H'0E9B'
RB4PPS           EQU  H'0E9C'
RB5PPS           EQU  H'0E9D'
RB6PPS           EQU  H'0E9E'
RB7PPS           EQU  H'0E9F'
RC0PPS           EQU  H'0EA0'
RC1PPS           EQU  H'0EA1'
RC2PPS           EQU  H'0EA2'
RC3PPS           EQU  H'0EA3'
RC4PPS           EQU  H'0EA4'
RC5PPS           EQU  H'0EA5'
RC6PPS           EQU  H'0EA6'
RC7PPS           EQU  H'0EA7'

;-----Bank30------------------
CLCDATA          EQU  H'0F0F'
CLC1CON          EQU  H'0F10'
CLC1POL          EQU  H'0F11'
CLC1SEL0         EQU  H'0F12'
CLC1SEL1         EQU  H'0F13'
CLC1SEL2         EQU  H'0F14'
CLC1SEL3         EQU  H'0F15'
CLC1GLS0         EQU  H'0F16'
CLC1GLS1         EQU  H'0F17'
CLC1GLS2         EQU  H'0F18'
CLC1GLS3         EQU  H'0F19'
CLC2CON          EQU  H'0F1A'
CLC2POL          EQU  H'0F1B'
CLC2SEL0         EQU  H'0F1C'
CLC2SEL1         EQU  H'0F1D'
CLC2SEL2         EQU  H'0F1E'
CLC2SEL3         EQU  H'0F1F'
CLC2GLS0         EQU  H'0F20'
CLC2GLS1         EQU  H'0F21'
CLC2GLS2         EQU  H'0F22'
CLC2GLS3         EQU  H'0F23'
CLC3CON          EQU  H'0F24'
CLC3POL          EQU  H'0F25'
CLC3SEL0         EQU  H'0F26'
CLC3SEL1         EQU  H'0F27'
CLC3SEL2         EQU  H'0F28'
CLC3SEL3         EQU  H'0F29'
CLC3GLS0         EQU  H'0F2A'
CLC3GLS1         EQU  H'0F2B'
CLC3GLS2         EQU  H'0F2C'
CLC3GLS3         EQU  H'0F2D'
CLC4CON          EQU  H'0F2E'
CLC4POL          EQU  H'0F2F'
CLC4SEL0         EQU  H'0F30'
CLC4SEL1         EQU  H'0F31'
CLC4SEL2         EQU  H'0F32'
CLC4SEL3         EQU  H'0F33'
CLC4GLS0         EQU  H'0F34'
CLC4GLS1         EQU  H'0F35'
CLC4GLS2         EQU  H'0F36'
CLC4GLS3         EQU  H'0F37'

;-----Bank31------------------
STATUS_SHAD      EQU  H'0FE4'
WREG_SHAD        EQU  H'0FE5'
BSR_SHAD         EQU  H'0FE6'
PCLATH_SHAD      EQU  H'0FE7'
FSR0L_SHAD       EQU  H'0FE8'
FSR0H_SHAD       EQU  H'0FE9'
FSR1L_SHAD       EQU  H'0FEA'
FSR1H_SHAD       EQU  H'0FEB'
STKPTR           EQU  H'0FED'
TOSL             EQU  H'0FEE'
TOSH             EQU  H'0FEF'

;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NOT_PD           EQU  H'0003'
NOT_TO           EQU  H'0004'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'


;----- INTCON Bits -----------------------------------------------------
IOCIF            EQU  H'0000'
INTF             EQU  H'0001'
TMR0IF           EQU  H'0002'
IOCIE            EQU  H'0003'
INTE             EQU  H'0004'
TMR0IE           EQU  H'0005'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'

T0IF             EQU  H'0002'
T0IE             EQU  H'0005'


